Repository: lwplugins/lw-firewall
Catalog: languages/lw-firewall-*.po
Languages: hu_hu

source: Lightweight firewall — rate-limits endpoints, blocks bots, bans repeat offenders, and adds security headers.
hu_hu: Könnyűsúlyú firewall — rate limitet alkalmaz endpointokra, blokkolja a botokat, kitiltja a visszaesőket, és security headereket ad hozzá.

source: Lightweight plugins for WordPress - minimal footprint, maximum impact.
hu_hu: Könnyűsúlyú bővítmények WordPresshez – minimális terhelés, maximális hatás.

source: Active
hu_hu: Aktív

source: Settings
hu_hu: Beállítások

source: Get Plugin
hu_hu: Bővítmény letöltése

source: Blocked Bots
hu_hu: Blokkolt botok

source: User-Agent strings to block (one per line, case-insensitive substring match).
hu_hu: Blokkolandó User-Agent stringek (soronként egy, kis- és nagybetűtől független részsztring egyezés).

source: Blocked User-Agents
hu_hu: Blokkolt User-Agentek

source: Requests matching these strings are immediately blocked with 403.
hu_hu: Az ezekre a stringekre illeszkedő kérések azonnal blokkolva lesznek 403-mal.

source: General
hu_hu: Általános

source: General Settings
hu_hu: Általános beállítások

source: Configure firewall protection for WooCommerce filter requests.
hu_hu: Állítsd be a firewall védelmet a WooCommerce filter kérésekhez.

source: Enable Firewall
hu_hu: Firewall engedélyezése

source: Enable firewall protection
hu_hu: Firewall védelem engedélyezése

source: When enabled, filter requests are monitored for bots and rate-limited per IP.
hu_hu: Ha engedélyezve van, a filter kéréseket botokra figyeljük és IP-nként rate limiteljük.

source: Storage Backend
hu_hu: Tároló backend

source: Auto-detect
hu_hu: Automatikus felismerés

source: File
hu_hu: Fájl

source: Storage backend for rate-limit counters. Auto-detect tries APCu, then Redis, then file.
hu_hu: Tároló backend a rate limit számlálókhoz. Az automatikus felismerés először az APCu-t, majd a Redist, majd a fájlt próbálja.

source: Maximum number of filter requests per IP within the time window.
hu_hu: A maximális filter kérések száma IP-nként az időablakon belül.

source: Time Window
hu_hu: Időablak

source: Time window in seconds for rate limiting.
hu_hu: Időablak másodpercben a rate limitinghez.

source: Rate Limit Action
hu_hu: Rate limit művelet

source: 302 Redirect (strip filters)
hu_hu: 302 átirányítás (filterek eltávolítása)

source: 429 Too Many Requests
hu_hu: 429 Túl sok kérés

source: Action to take when rate limit is exceeded.
hu_hu: A végrehajtandó művelet, ha a rate limit túllépésre kerül.

source: Filter Parameters
hu_hu: Filter paraméterek

source: URL parameter prefixes to monitor (one per line). Default: filter_, query_type_
hu_hu: Figyelt URL paraméter előtagok (soronként egy). Alapértelmezett: filter_, query_type_

source: IP Rules
hu_hu: IP szabályok

source: Manually allow or block IP addresses. Supports individual IPs and CIDR ranges (e.g. 192.168.1.0/24).
hu_hu: IP-címek kézi engedélyezése vagy blokkolása. Támogatja az egyedi IP-ket és a CIDR tartományokat (pl. 192.168.1.0/24).

source: IPs that are never rate-limited or blocked (one per line).
hu_hu: IP-k, amelyekre soha nem vonatkozik rate limit vagy blokkolás (soronként egy).

source: IPs that are always blocked with 403 Forbidden (one per line).
hu_hu: IP-k, amelyek mindig 403 Forbiddennel blokkolva vannak (soronként egy).

source: Logs
hu_hu: Naplók

source: Request Logging
hu_hu: Kérések naplózása

source: Enable Logging
hu_hu: Naplózás engedélyezése

source: Log blocked requests
hu_hu: Blokkolt kérések naplózása

source: Stores the last 100 blocked requests in the database.
hu_hu: Az utolsó 100 blokkolt kérést eltárolja az adatbázisban.

source: Clear all log entries on save
hu_hu: Mentéskor az összes naplóbejegyzés törlése

source: No log entries yet.
hu_hu: Még nincsenek naplóbejegyzések.

source: Time
hu_hu: Idő

source: Reason
hu_hu: Ok

source: Protection
hu_hu: Védelem

source: Endpoint Protection
hu_hu: Endpoint-védelem

source: Enable rate limiting on specific WordPress endpoints.
hu_hu: Engedélyezd a rate limitinget bizonyos WordPress endpointokon.

source: Rate-limit wp-cron.php requests
hu_hu: wp-cron.php kérések rate limitingje

source: Protects against DDoS attacks targeting wp-cron.php.
hu_hu: Véd a wp-cron.php-t célzó DDoS támadások ellen.

source: Rate-limit xmlrpc.php requests
hu_hu: xmlrpc.php kérések rate limitingje

source: Protects against brute-force and DDoS via xmlrpc.php.
hu_hu: Véd a brute-force és DDoS támadások ellen xmlrpc.php-n keresztül.

source: Rate-limit wp-login.php requests
hu_hu: wp-login.php kérések rate limitingje

source: Protects against brute-force login attempts.
hu_hu: Véd a brute-force bejelentkezési próbálkozások ellen.

source: Rate-limit REST API requests
hu_hu: REST API kérések rate limitingje

source: Rate-limits /wp-json/ requests per IP.
hu_hu: IP-nként rate limitingeli a /wp-json/ kéréseket.

source: Block 404 flood
hu_hu: 404 flood blokkolása

source: Blocks IPs that generate excessive 404 errors (vulnerability scanning).
hu_hu: Blokkolja azokat az IP-ket, amelyek túl sok 404 hibát generálnak (sebezhetőség-szkennelés).

source: Auto-Ban
hu_hu: Automatikus tiltás

source: Automatically ban IPs that repeatedly exceed rate limits.
hu_hu: Automatikusan kitiltja azokat az IP-ket, amelyek ismételten túllépik a rate limitet.

source: Enable Auto-Ban
hu_hu: Automatikus tiltás engedélyezése

source: Ban IPs after repeated violations
hu_hu: IP-k tiltása ismételt szabálysértések után

source: After the threshold is reached, the IP is banned for the configured duration.
hu_hu: A küszöb elérése után az IP a beállított időtartamra tiltásra kerül.

source: Ban Threshold
hu_hu: Tiltási küszöb

source: Number of rate-limit violations before an IP is banned.
hu_hu: A rate limit megsértéseinek száma, ami után egy IP tiltásra kerül.

source: Ban Duration
hu_hu: Tiltás időtartama

source: How long the ban lasts in seconds (3600 = 1 hour).
hu_hu: Mennyi ideig tart a tiltás másodpercekben (3600 = 1 óra).

source: Security
hu_hu: Biztonság

source: Security Headers
hu_hu: Biztonsági headerek

source: Add security-related HTTP response headers to every page.
hu_hu: Biztonsággal kapcsolatos HTTP válaszheaderek hozzáadása minden oldalhoz.

source: Enable Security Headers
hu_hu: Biztonsági headerek engedélyezése

source: Add security headers to all responses
hu_hu: Biztonsági headerek hozzáadása minden válaszhoz

source: Headers added:
hu_hu: Hozzáadott headerek:

source: What do these headers do?
hu_hu: Mire valók ezek a headerek?

source: Prevents browsers from MIME-sniffing the content type. Without this, a browser might interpret a file differently than intended — for example, treating a text file as JavaScript — which can lead to XSS attacks.
hu_hu: Megakadályozza, hogy a böngészők MIME-sniffinggel kitalálják a content type-ot. Enélkül a böngésző a fájlt a szándéktól eltérően értelmezheti — például egy szövegfájlt JavaScriptként — ami XSS támadásokhoz vezethet.

source: Prevents your site from being embedded in an iframe on another domain. This protects against clickjacking attacks, where a malicious site overlays your page with invisible elements to trick users into clicking.
hu_hu: Megakadályozza, hogy a webhelyedet egy másik domainen iframe-be ágyazzák. Ez véd a clickjacking támadások ellen, amikor egy rosszindulatú oldal láthatatlan elemekkel takarja le az oldaladat, hogy rávegye a felhasználókat a kattintásra.

source: Controls how much referrer information is sent when navigating away from your site. The "strict-origin-when-cross-origin" value sends the full URL for same-origin requests but only the origin (domain) for cross-origin requests, preventing sensitive URL paths from leaking to third parties.
hu_hu: Szabályozza, mennyi referrer információ kerül elküldésre, amikor elnavigálsz a webhelyedről. A "strict-origin-when-cross-origin" érték same-origin kéréseknél a teljes URL-t küldi, cross-origin kéréseknél viszont csak az origint (domaint), megakadályozva, hogy érzékeny URL útvonalak harmadik felekhez kerüljenek.

source: Disables browser features that your site does not use — camera, microphone, and geolocation. This prevents malicious scripts (e.g. from compromised third-party libraries) from silently accessing these sensitive APIs.
hu_hu: Kikapcsolja azokat a böngészőfunkciókat, amiket a webhelyed nem használ — kamera, mikrofon és geolokáció. Ez megakadályozza, hogy rosszindulatú scriptek (pl. kompromittált third-party library-kből) észrevétlenül hozzáférjenek ezekhez az érzékeny API-khoz.

source: Enables the built-in XSS filter in older browsers (IE, older Chrome). When a reflected XSS attack is detected, the browser blocks the page instead of rendering it. Modern browsers use Content-Security-Policy instead, but this header provides a safety net for legacy browsers.
hu_hu: Bekapcsolja a beépített XSS szűrőt a régebbi böngészőkben (IE, régebbi Chrome). Ha reflected XSS támadást észlel, a böngésző az oldal renderelése helyett blokkolja azt. A modern böngészők inkább a Content-Security-Policy-t használják, de ez a header egy plusz védőhálót ad a legacy böngészőknek.

source: Status
hu_hu: Állapot

source: Firewall Status
hu_hu: Tűzfal állapota

source: MU-Plugin Worker
hu_hu: MU-bővítmény worker

source: Installed
hu_hu: Telepítve

source: Not installed
hu_hu: Nincs telepítve

source: The MU-plugin worker intercepts requests early, before themes and plugins load.
hu_hu: Az MU-bővítmény worker korán elfogja a kéréseket, még a sablonok és bővítmények betöltése előtt.

source: Worker Version
hu_hu: Worker verzió

source: Mismatch — expected %s (will auto-update on next page load)
hu_hu: Eltérés — a várt érték %s (a következő oldalbetöltéskor automatikusan frissül)

source: Active Storage
hu_hu: Aktív tároló

source: Storage backend used for rate-limit counters.
hu_hu: A rate limit számlálókhoz használt tároló backend.

source: Reinstall Worker
hu_hu: Worker újratelepítése

source: Reinstall MU-plugin worker on save
hu_hu: MU-bővítmény worker újratelepítése mentéskor

source: Check this and save to reinstall the worker file.
hu_hu: Jelöld be ezt, majd mentsd el a worker fájl újratelepítéséhez.

source: Firewall
hu_hu: Tűzfal

source: Settings saved.
hu_hu: Beállítások elmentve.

source: Save Changes
hu_hu: Változtatások mentése
